In [3]:
import sqlite3

connection =sqlite3.connect("doubt_session.db")

In [4]:
cursor = connection.cursor()

In [19]:
#Users
query = """
CREATE TABLE Users(
  UserID INTEGER PRIMARY KEY AUTOINCREMENT,
    UserName TEXT NOT NULL,
    Email TEXT UNIQUE NOT NULL,
    Password TEXT NOT NULL,
    RegisteredAt TIMESTAMP DEFAULT CURRENT_TIMESTAMP
)
"""
cursor.execute(query)

OperationalError: table Users already exists

In [ ]:
query = """ 
INSERT INTO Users(UserName,Email,Password) values("Priyanka","priyanka@gmail.com","priyanka@123")
"""
cursor.execute(query)

In [ ]:
query = """ 
INSERT INTO Users(UserName,Email,Password) values("sonu","sonu@gmail.com","sonu@123")
"""
cursor.execute(query)

In [ ]:
import pandas as pd
users_data = pd.read_sql_query("select * from Users",connection)
users_data

   UserID  UserName               Email      Password         RegisteredAt
0       1  Priyanka  priyanka@gmail.com  priyanka@123  2025-06-25 14:28:55
1       2      sonu      sonu@gmail.com      sonu@123  2025-06-25 14:29:20

In [ ]:
#Drivers 
query = """
CREATE TABLE Drivers(
  DriverID INTEGER PRIMARY KEY AUTOINCREMENT,
    DriverName TEXT NOT NULL,
    Phone TEXT UNIQUE NOT NULL,
    Status TEXT DEFAULT 'Available',
    RegisteredAt TIMESTAMP DEFAULT CURRENT_TIMESTAMP
)
"""
cursor.execute(query)

In [ ]:
query = """ 
INSERT INTO Drivers(DriverName,Phone,Status) values("Rajesh","8908908766","available"),("Mahesj","6786786547","Ride Booked")
"""
cursor.execute(query)

In [ ]:

drivers_data_data = pd.read_sql_query("select * from Drivers",connection)
drivers_data_data

   DriverID DriverName       Phone       Status         RegisteredAt
0         1     Rajesh  8908908766    available  2025-06-25 14:31:15
1         2     Mahesj  6786786547  Ride Booked  2025-06-25 14:31:15

In [ ]:
#Vehicles
query = """
CREATE TABLE IF NOT EXISTS Vehicles (
    VehicleID INTEGER PRIMARY KEY AUTOINCREMENT,
    DriverID INTEGER NOT NULL,
    VehicleNumber TEXT UNIQUE NOT NULL,
    VehicleType TEXT NOT NULL,
    LicensePlate TEXT NOT NULL,
    FOREIGN KEY (DriverID) REFERENCES Drivers(DriverID)
);
"""
cursor.execute(query)

In [ ]:
query = """ 
INSERT INTO Vehicles(DriverId,VehicleNumber,VehicleType,LicensePlate) 
values(1,"1234","suv","dsnmfsd"),(2,"4567","suv","werrt")
"""
cursor.execute(query)

In [ ]:
import pandas as pd
vehicle_data = pd.read_sql_query("select * from Vehicles",connection)
vehicle_data

   VehicleID  DriverID VehicleNumber VehicleType LicensePlate
0          1         1          1234         suv      dsnmfsd
1          2         2          4567         suv        werrt

In [ ]:
#Rides
query = """
CREATE TABLE IF NOT EXISTS Rides (
    RideID INTEGER PRIMARY KEY AUTOINCREMENT,
    UserID INTEGER NOT NULL,
    DriverID INTEGER,
    PickupLocation TEXT NOT NULL,
    DropLocation TEXT NOT NULL,
    DistanceKM REAL,
    FareAmount REAL,
    Status TEXT DEFAULT 'Requested',
    RequestTime TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    StartTime TIMESTAMP,
    EndTime TIMESTAMP,
    FOREIGN KEY (UserID) REFERENCES Users(UserID),
    FOREIGN KEY (DriverID) REFERENCES Drivers(DriverID)
);
"""

cursor.execute(query)

In [ ]:
query = """ 
INSERT INTO Rides(UserId, DriverId,PickupLocation,DropLocation,DistanceKM,FareAmount,Status,RequestTime,StartTime,EndTime) 
values(1,2,"powai","candivali",12,230,"Rie started",6,2,2.10),(2,1,"andheri","dadar",25,500,"Ride booked",10,4,6)
"""
cursor.execute(query)

In [ ]:
import pandas as pd
ride_data = pd.read_sql_query("select * from Rides",connection)
ride_data

,RideID,UserID,DriverID,PickupLocation,DropLocation,DistanceKM,FareAmount,Status,RequestTime,StartTime,EndTime
0,1,1,2,powai,candivali,12.0,230.0,Rie started,6,2,2.1
1,2,2,1,andheri,dadar,25.0,500.0,Ride booked,10,4,6.0

In [ ]:
#Payment
query = """
CREATE TABLE IF NOT EXISTS Payments (
    PaymentID INTEGER PRIMARY KEY AUTOINCREMENT,
    RideID INTEGER NOT NULL,
    UserID INTEGER NOT NULL,
    Amount REAL NOT NULL,
    PaymentMethod TEXT NOT NULL,
    PaymentTime TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    FOREIGN KEY (RideID) REFERENCES Rides(RideID),
    FOREIGN KEY (UserID) REFERENCES Users(UserID)
);
"""

cursor.execute(query)

In [5]:
query = """ 
INSERT INTO Payments(RideId,UserId, Amount, PaymentMethod, PaymentTime) 
values(1,1,230,"UPI",12),(2,2,500,"Cash",7)
"""
cursor.execute(query)

In [6]:
import pandas as pd
payment_data = pd.read_sql_query("select * from Payments",connection)
payment_data

   PaymentID  RideID  UserID  Amount PaymentMethod  PaymentTime
0          1       1       1   230.0           UPI           12
1          2       2       2   500.0          Cash            7

In [ ]:
#Ratings
query = """
CREATE TABLE IF NOT EXISTS Ratings (
    RatingID INTEGER PRIMARY KEY AUTOINCREMENT,
    RideID INTEGER NOT NULL,
    RaterType TEXT CHECK(RaterType IN ('User', 'Driver')) NOT NULL,
    RaterID INTEGER NOT NULL,
    RateeID INTEGER NOT NULL,
    Stars INTEGER CHECK(Stars BETWEEN 1 AND 5),
    Review TEXT,
    RatedAt TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    FOREIGN KEY (RideID) REFERENCES Rides(RideID)
);
"""

cursor.execute(query)

In [8]:
query = """ 
INSERT INTO Ratings(RideId,RaterType,RaterID,RateeID,Stars,Review) 
values(1,"User",1,1,3,4),(2,"Driver",2,2,4,3)
"""
cursor.execute(query)

In [9]:
import pandas as pd
rating_data = pd.read_sql_query("select * from Ratings",connection)
rating_data

,RatingID,RideID,RaterType,RaterID,RateeID,Stars,Review,RatedAt
0,1,1,User,1,1,3,4,2025-06-25 15:01:17
1,2,2,Driver,2,2,4,3,2025-06-25 15:01:17

In [ ]:
select * from Rides where FareAmount>300


select count(*)  from Rides where FareAmount>300

select * from Rides orderBy FareAmount DSEC limit 3

select * from Rides where status != "Completed"

select round(FareAmount/ DistanceKM) as fareperkm from Rides

select RideID, FareaAmount,CASE 
WHEN FareAmount >300 then "Expnesive"
ELSE "Chip"
END AS Fareytpe
from Rides


select Status, count(*) from Rides groupBy status


select Status, sum(*) from Rides groupBy status

select Status, average(*) from Rides groupBy status